espressif/esp-idf/components/hal/esp32s3/include/hal/mcpwm_ll.h
static inline void mcpwm_ll_generator_set_action_on_trigger_event(mcpwm_dev_t *mcpwm, int operator_id, int generator_id,
        mcpwm_timer_direction_t direction, int trig_id, int action)
{
    if (direction == MCPWM_TIMER_DIRECTION_UP) { // ut0, ut1
        mcpwm->channel[operator_id].generator[generator_id].val &= ~(0x03 << (trig_id * 2 + 8));
        mcpwm->channel[operator_id].generator[generator_id].val |= action << (trig_id * 2 + 8);
    } else if (direction == MCPWM_TIMER_DIRECTION_DOWN) { // dt0, dt1
        mcpwm->channel[operator_id].generator[generator_id].val &= ~(0x03 << (trig_id * 2 + 20));
        mcpwm->channel[operator_id].generator[generator_id].val |= action << (trig_id * 2 + 20);
    }
}

static inline void mcpwm_ll_gen_trigger_noncontinue_force_action(mcpwm_dev_t *mcpwm, int operator_id, int generator_id)
{
    if (generator_id == 0) {
        mcpwm->channel[operator_id].gen_force.a_nciforce = ~mcpwm->channel[operator_id].gen_force.a_nciforce;
    } else {
        mcpwm->channel[operator_id].gen_force.b_nciforce = ~mcpwm->channel[operator_id].gen_force.b_nciforce;
    }
}

static inline void mcpwm_ll_gen_disable_continue_force_action(mcpwm_dev_t *mcpwm, int operator_id, int generator_id)
{
    mcpwm->channel[operator_id].gen_force.cntu_force_upmethod = 0; // update force method immediately
    if (generator_id == 0) {
        mcpwm->channel[operator_id].gen_force.a_cntuforce_mode = 0;
    } else {
        mcpwm->channel[operator_id].gen_force.b_cntuforce_mode = 0;
    }
}

static inline void mcpwm_ll_gen_disable_noncontinue_force_action(mcpwm_dev_t *mcpwm, int operator_id, int generator_id)
{
    if (generator_id == 0) {
        mcpwm->channel[operator_id].gen_force.a_nciforce_mode = 0;
    } else {
        mcpwm->channel[operator_id].gen_force.b_nciforce_mode = 0;
    }
}

static inline void mcpwm_ll_gen_set_continue_force_level(mcpwm_dev_t *mcpwm, int operator_id, int generator_id, int level)
{
    mcpwm->channel[operator_id].gen_force.cntu_force_upmethod = 0; // update force method immediately
    if (generator_id == 0) {
        mcpwm->channel[operator_id].gen_force.a_cntuforce_mode = level + 1;
    } else {
        mcpwm->channel[operator_id].gen_force.b_cntuforce_mode = level + 1;
    }
}

static inline void mcpwm_ll_gen_set_noncontinue_force_level(mcpwm_dev_t *mcpwm, int operator_id, int generator_id, int level)
{
    if (generator_id == 0) {
        mcpwm->channel[operator_id].gen_force.a_nciforce_mode = level + 1;
    } else {
        mcpwm->channel[operator_id].gen_force.b_nciforce_mode = level + 1;
    }
}

/********************* Dead time registers *******************/

static inline void mcpwm_ll_deadtime_resolution_to_timer(mcpwm_dev_t *mcpwm, int operator_id, bool same)
{
    // whether to make the resolution of dead time delay module the same to the timer connected with operator
    mcpwm->channel[operator_id].db_cfg.clk_sel = same;
}

static inline void mcpwm_ll_deadtime_red_select_generator(mcpwm_dev_t *mcpwm, int operator_id, int generator)
{
    mcpwm->channel[operator_id].db_cfg.red_insel = generator;
}

static inline void mcpwm_ll_deadtime_fed_select_generator(mcpwm_dev_t *mcpwm, int operator_id, int generator)
{
    mcpwm->channel[operator_id].db_cfg.fed_insel = generator;
}

static inline void mcpwm_ll_deadtime_bypass_path(mcpwm_dev_t *mcpwm, int operator_id, int path, bool bypass)
{
    if (bypass) {
        mcpwm->channel[operator_id].db_cfg.val |= 1 << (path + 15);
    } else {
        mcpwm->channel[operator_id].db_cfg.val &= ~(1 << (path + 15));
    }
}

static inline void mcpwm_ll_deadtime_invert_outpath(mcpwm_dev_t *mcpwm, int operator_id, int path, bool invert)
{
    if (invert) {
        mcpwm->channel[operator_id].db_cfg.val |= 1 << (path + 13);
    } else {
        mcpwm->channel[operator_id].db_cfg.val &= ~(1 << (path + 13));
    }
}

static inline void mcpwm_ll_deadtime_swap_out_path(mcpwm_dev_t *mcpwm, int operator_id, int path, bool swap)
{
    if (swap) {
        mcpwm->channel[operator_id].db_cfg.val |= 1 << (path + 9);
    } else {
        mcpwm->channel[operator_id].db_cfg.val &= ~(1 << (path + 9));
    }
}

static inline void mcpwm_ll_deadtime_enable_deb(mcpwm_dev_t *mcpwm, int operator_id, bool enable)
{
    mcpwm->channel[operator_id].db_cfg.deb_mode = enable;
}

static inline uint32_t mcpwm_ll_deadtime_get_switch_topology(mcpwm_dev_t *mcpwm, int operator_id)
{
    return (mcpwm->channel[operator_id].db_cfg.deb_mode << 8) | (mcpwm->channel[operator_id].db_cfg.b_outswap << 7) |
           (mcpwm->channel[operator_id].db_cfg.a_outswap << 6) | (mcpwm->channel[operator_id].db_cfg.fed_insel << 5) |
           (mcpwm->channel[operator_id].db_cfg.red_insel << 4) | (mcpwm->channel[operator_id].db_cfg.fed_outinvert << 3) |
           (mcpwm->channel[operator_id].db_cfg.red_outinvert << 2) | (mcpwm->channel[operator_id].db_cfg.a_outbypass << 1) |
           (mcpwm->channel[operator_id].db_cfg.b_outbypass << 0);
}

static inline void mcpwm_ll_deadtime_set_falling_delay(mcpwm_dev_t *mcpwm, int operator_id, uint32_t fed)
{
    mcpwm->channel[operator_id].db_fed_cfg.fed = fed - 1;
}

static inline uint32_t mcpwm_ll_deadtime_get_falling_delay(mcpwm_dev_t *mcpwm, int operator_id)
{
    return mcpwm->channel[operator_id].db_fed_cfg.fed + 1;
}

static inline void mcpwm_ll_deadtime_set_rising_delay(mcpwm_dev_t *mcpwm, int operator_id, uint32_t red)
{
    mcpwm->channel[operator_id].db_red_cfg.red = red - 1;
}

static inline uint32_t mcpwm_ll_deadtime_get_rising_delay(mcpwm_dev_t *mcpwm, int operator_id)
{
    return mcpwm->channel[operator_id].db_red_cfg.red + 1;
}

static inline void mcpwm_ll_deadtime_update_delay_at_once(mcpwm_dev_t *mcpwm, int operator_id)
{
    mcpwm->channel[operator_id].db_cfg.fed_upmethod = 0;
    mcpwm->channel[operator_id].db_cfg.red_upmethod = 0;
}

static inline void mcpwm_ll_deadtime_enable_update_delay_on_tez(mcpwm_dev_t *mcpwm, int operator_id, bool enable)
{
    if (enable) {
        mcpwm->channel[operator_id].db_cfg.fed_upmethod |= 1 << 0;
        mcpwm->channel[operator_id].db_cfg.red_upmethod |= 1 << 0;
    } else {
        mcpwm->channel[operator_id].db_cfg.fed_upmethod &= ~(1 << 0);
        mcpwm->channel[operator_id].db_cfg.red_upmethod &= ~(1 << 0);
    }
}

static inline void mcpwm_ll_deadtime_enable_update_delay_on_tep(mcpwm_dev_t *mcpwm, int operator_id, bool enable)
{
    if (enable) {
        mcpwm->channel[operator_id].db_cfg.fed_upmethod |= 1 << 1;
        mcpwm->channel[operator_id].db_cfg.red_upmethod |= 1 << 1;
    } else {
        mcpwm->channel[operator_id].db_cfg.fed_upmethod &= ~(1 << 1);
        mcpwm->channel[operator_id].db_cfg.red_upmethod &= ~(1 << 1);
    }
}

